---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SweepBaseVertOffset
source: html/1abd367a-a574-025b-28ae-997e6f6d7a4d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SweepBaseVertOffset Property

"Vertical Profile Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId SweepBaseVertOffset { get; }
```